//========================================================================
//! @file       Main.cpp
//{=======================================================================
//!
//! @brief      <Заголовок>\n
//! @brief      <Подзаголовок>
//!
//! @version    [Version 0.01 alpha, build 1]
//! @author     Copyright (C) <Автор>, <Год> (<Имя> <Почта>)
//! @date       <Дата>
//!
//! @par        Протестировано
//!           - (TODO: список платформ)
//!
//! @todo     - (TODO: список ближайших планов по этому файлу)
//!
//! @bug      - (TODO: список найденных ошибок в этом файле)
//!
//! @par        История изменений файла
//!           - Версия 0.01 Alpha
//!             - Только что созданный файл
//!
//}=======================================================================

#include "TXLib.h"

int main()
    {
    txCreateWindow (800, 600);
    if(PAGE == "Меню")
    {
     txSetColor(TX_GRAY,5);
     txSetFillColor(TX_BLACK);
     txRectangle(0,0,800,600);
     txSelectFont("Arial", 35);
     txSetColor(TX_GRAY,5);
     txSetFillColor(TX_BLACK);
     txDrawText(200,50,300,150, "Автосалон");
     txDrawText(300,200,500,350, "Создай свою машину");
     txRectangle(400,400,500,500);
     txDrawText(400,400,600,500,"Начать");
    }

    return 0;
    }

